package JavaBasic.Module6Task1;

/*
 Создайте массив, содержащий 10 первых нечетных чисел. Выведете элементы массива на консоль в одну строку, разделяя запятой.
 */
public class Task1 {
    public static void main(String[] args) {
        int[] a = {2,4,6,8,10,12,14,16,18,20};
        for(int i : a)//пробігаємося по масиву. кожен елемент масиву присвоюємо перемінній і.
        { System.out.print(i+",");
        }
    }
}
